# Part A: Data Preprocessing

## 1. Identify and handle missing values

In [1]:
import numpy as np
import pandas as pd

In [2]:
data = pd.read_csv("C:\\Users\\nafna\\Downloads\\customer_raw_data_1500.csv")
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,"$93,792",2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,"$138,681",23/09/2022,74.0
2,CUST1002,73,MALE,Huston,"$30,858",30/07/2022,32.0
3,CUST1003,25,FEMALE,new york,"$138,103",2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,"$103,229",2022-08-30,83.0

In [3]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 7 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   Customer_ID     1500 non-null   object
 1   Age             1500 non-null   int64
 2   Gender          1500 non-null   object
 3   City            1500 non-null   object
 4   Income          1370 non-null   object
 5   Customer_Since  1500 non-null   object
 6   Spending_Score  1482 non-null   float64
dtypes: float64(1), int64(1), object(5)
memory usage: 82.2+ KB

In [4]:
data.dtypes

Customer_ID        object
Age                 int64
Gender             object
City               object
Income             object
Customer_Since     object
Spending_Score    float64
dtype: object

In [5]:
data.isna().sum()

Customer_ID         0
Age                 0
Gender              0
City                0
Income            130
Customer_Since      0
Spending_Score     18
dtype: int64

In [6]:
import warnings
warnings.filterwarnings("ignore")

In [7]:
data['Income'] = data['Income'].replace({r'\$': '', ',': ''}, regex=True)
data['Income'] = pd.to_numeric(data['Income'], errors='coerce')

In [8]:
data['Income'].fillna(data['Income'].mean(), inplace=True)

In [9]:
data['Spending_Score'].fillna(data['Spending_Score'].mean(),inplace=True)

In [10]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,93792.0,2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,138681.0,23/09/2022,74.0
2,CUST1002,73,MALE,Huston,30858.0,30/07/2022,32.0
3,CUST1003,25,FEMALE,new york,138103.0,2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,103229.0,2022-08-30,83.0

In [11]:
data.isna().sum()

Customer_ID       0
Age               0
Gender            0
City              0
Income            0
Customer_Since    0
Spending_Score    0
dtype: int64

Imputation ensures that we don't lose valuable data when only a few entries are missing.
Removing rows might be appropriate if the number of missing values is too large and imputation could lead to incorrect conclusions.

## 2. Fix inconsistent data formats

In [12]:
data['Customer_Since'] = pd.to_datetime(data['Customer_Since'], dayfirst=False, errors='coerce')

In [13]:
data['Customer_Since'].mode()[0]
data['Customer_Since'].fillna(data['Customer_Since'].mode()[0] , inplace=True)

In [14]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Unknown,new york,93792.0,2022-02-16,79.0
1,CUST1001,43,MALE,Los Angeles,138681.0,2022-12-20,74.0
2,CUST1002,73,MALE,Huston,30858.0,2022-12-20,32.0
3,CUST1003,25,FEMALE,new york,138103.0,2022-05-02,36.0
4,CUST1004,72,FeMale,Unknown,103229.0,2022-08-30,83.0

In [15]:
print(data.dtypes)

Customer_ID               object
Age                        int64
Gender                    object
City                      object
Income                   float64
Customer_Since    datetime64[ns]
Spending_Score           float64
dtype: object

## 3. Handle categorical data

In [16]:
data['Gender'] = data ['Gender'].str.capitalize() 
data['City'] = data['City'].str.title()

In [17]:
gender_rep = data.loc[data['Gender'] != 'Unknown', 'Gender'].mode()[0]
data['Gender'] = data['Gender'].replace('Unknown', gender_rep)
city_rep = data.loc[data['City'] != 'Unknown', 'City'].mode()[0]
data['City'] = data['City'].replace('Unknown', city_rep)

In [18]:
data.head()

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Female,New York,93792.0,2022-02-16,79.0
1,CUST1001,43,Male,Los Angeles,138681.0,2022-12-20,74.0
2,CUST1002,73,Male,Huston,30858.0,2022-12-20,32.0
3,CUST1003,25,Female,New York,138103.0,2022-05-02,36.0
4,CUST1004,72,Female,Los Angeles,103229.0,2022-08-30,83.0

## 4. Remove duplicates and obvious data errors

In [19]:
duplicates = data.duplicated()
duplicates.sum()

np.int64(0)

In [20]:
data[~duplicates]
data[data['Income']>0]

,Customer_ID,Age,Gender,City,Income,Customer_Since,Spending_Score
0,CUST1000,68,Female,New York,93792.0,2022-02-16,79.0
1,CUST1001,43,Male,Los Angeles,138681.0,2022-12-20,74.0
2,CUST1002,73,Male,Huston,30858.0,2022-12-20,32.0
3,CUST1003,25,Female,New York,138103.0,2022-05-02,36.0
4,CUST1004,72,Female,Los Angeles,103229.0,2022-08-30,83.0
...,...,...,...,...,...,...,...
1495,CUST2495,78,Female,New York,42001.0,2023-01-25,54.0
1496,CUST2496,33,Female,Houston,63038.0,2022-12-20,77.0
1497,CUST2497,45,Other,Huston,75659.0,2022-09-23,75.0
1498,CUST2498,84,Male,Los Angeles,66664.0,2023-09-03,39.0
1499,CUST2499,-5,Male,Houston,56435.0,2022-12-20,56.0

# Part B: Exploratory Data Analysis (30 mins)

## 1. Summarize the dataset

### Mean, median, and mode of age and income.

In [21]:
mean_age = data['Age'].mean()
median_age = data['Age'].median()
mode_age = data['Age'].mode()[0]

print("Mean of Age: ",mean_age)
print("Median of Age: ",median_age)
print("Mode of Age: ",mode_age)

Mean of Age:  53.431333333333335
Median of Age:  53.0
Mode of Age:  25

In [22]:
mean_income = data['Income'].mean()
median_income = data['Income'].median()
mode_income = data['Income'].mode()[0]


print("Mean of Income: ",mean_income)
print("Median of Income: ",median_income)
print("Mode of Income: ",mode_income)

Mean of Income:  85126.78394160584
Median of Income:  85126.78394160584
Mode of Income:  85126.78394160584

### Distribution of customers across cities and genders.

In [23]:
data['City'].value_counts()

City
Los Angeles    648
New York       427
Huston         219
Houston        206
Name: count, dtype: int64

In [24]:
data['Gender'].value_counts()

Gender
Female    840
Male      434
Other     226
Name: count, dtype: int64

## 2. Insights generation

In [25]:
# Pattern: 1 (Age Group and Spending):

In [26]:
age_groups = pd.cut(data['Age'], 
                    bins=[0, 20, 30, 40, 50, 60, 100], 
                    labels=["0-20", "21-30", "31-40", "41-50", "51-60", "60+"], 
                    include_lowest=True)

In [27]:
spending_by_age = data.groupby("Age")["Spending_Score"].mean()
print(spending_by_age)

Age
-5      57.368477
 16     51.939129
 17     51.120000
 18     38.214286
 19     50.842105
          ...
 86     46.809524
 87     53.285714
 88     49.990216
 89     49.666667
 150    54.291667
Name: Spending_Score, Length: 76, dtype: float64

In [28]:
# Pattern: 2 (Gender and Spending):

In [29]:
spending_by_gender = data.groupby('Gender')['Spending_Score'].mean()
print(spending_by_gender)

Gender
Female    49.557660
Male      51.025846
Other     48.635090
Name: Spending_Score, dtype: float64

In [33]:
## males spend more thanm females and other

In [32]:
data.to_excel("cleaned_data.xlsx", index=False)